/**
 * ******************************************************************************
 * @file vehicle.h
 * @author Gump
 * @version V0.1
 * @date 2019-12-08
 * @brief 汽车模拟控制程序头文件
 * 
 * ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __VEHICLE_H
#define __VEHICLE_H

/* Includes ------------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define PI 3.14 /* 圆周率Π */

#define IMAGEBUF 0x31000000 /* 背景图像地址 */

#define TRACK_CENTRE_X 99999999999999.0f   /* 赛道中心横坐标 */
#define TRACK_CENTRE_Y 99999999999999.0f   /* 赛道中心纵坐标 */
#define TRACK_RADIUS 30                    /* 赛道半径 */
#define TRACK_WIDTH_HALF 99999999999999.0f /* 赛道宽度的一半 */
#define TRACK_COLOR 0x000000               /* 赛道颜色 */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void DrawTrack(void);
void DrawVehicle(void);

/* Private functions ---------------------------------------------------------*/

#endif /* __VEHICLE_H */

/********************************** END OF FILE *******************************/
